In [44]:
import pandas as pd
frame = pd.DataFrame({"numbers":range(10), "chars":['a']*10})
frame

   numbers chars
0        0     a
1        1     a
2        2     a
3        3     a
4        4     a
5        5     a
6        6     a
7        7     a
8        8     a
9        9     a

In [45]:
frame = pd.read_csv(r'C:\Users\User\PycharmProjects\ML\dataset.tsv',header = 0, sep='\t')
frame.columns

Index(['Name', 'Birth', 'City', 'Position'], dtype='object')

In [46]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [47]:
new_line = {"Name": "Агеев Р.Н.", "Birth": '20.06.2001', "City": "Актобе"}
frame.append(new_line, ignore_index=True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6       Агеев Р.Н.  20.06.2001     Актобе       NaN

In [48]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [49]:
frame = frame.append(new_line, ignore_index=True)

In [50]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6       Агеев Р.Н.  20.06.2001     Актобе       NaN

In [51]:
frame['IsStudent'] = ["False"]*5 + ["True"]*2

In [52]:
frame

              Name       Birth       City  Position IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер     False
2       Белов М.М.  13.02.1980     Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     False
4      Рыбина Е.П.  19.11.1985     Москва   инженер     False
5     Костров С.О.  31.05.1985     Москва    стажер      True
6       Агеев Р.Н.  20.06.2001     Актобе       NaN      True

In [53]:
print(frame['IsStudent'])

0    False
1    False
2    False
3    False
4    False
5     True
6     True
Name: IsStudent, dtype: object

In [60]:
frame.drop(['Birth'], axis=1, inplace=True)  # We have to use 'inplace' in order to TRULY replace smth,
                                             #bc otherwise it will return the copy
frame

              Name       City  Position IsStudent
0      Иванов А.А.     Москва       NaN     False
1     Сорокин И.В.  Волгоград   инженер     False
2       Белов М.М.     Ростов  менеджер     False
3  Мельникова Д.С.     Ростов       NaN     False
4      Рыбина Е.П.     Москва   инженер     False

In [61]:
frame.to_csv('upd_dataset.csv', sep=',', header=True, index=None)

In [62]:
!cat upd_dataset.csv

"cat" ­Ґ пў«пҐвбп ў­гваҐ­­Ґ© Ё«Ё ў­Ґи­Ґ©
Є®¬ ­¤®©, ЁбЇ®«­пҐ¬®© Їа®Ја ¬¬®© Ё«Ё Ї ЄҐв­л¬ д ©«®¬.

In [63]:
'''
2nd Lesson START
'''

'\n2nd Lesson START\n'

In [64]:
frame = pd.read_csv(r'C:\Users\User\PycharmProjects\ML\dataset.tsv',header = 0, sep='\t')
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [65]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [66]:
frame.Birth = frame.Birth.apply(pd.to_datetime)

In [67]:
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [68]:
frame.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
dtype: object

In [69]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Birth     6 non-null      datetime64[ns]
 2   City      6 non-null      object
 3   Position  4 non-null      object
dtypes: datetime64[ns](1), object(3)
memory usage: 320.0+ bytes

In [70]:
frame.fillna('Разнорабочий', inplace=True)

In [71]:
frame

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  Разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  Разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

In [73]:
frame.Position # Тоже самое было бы, если бы вызвал frame['Position']

0    Разнорабочий
1         инженер
2        менеджер
3    Разнорабочий
4         инженер
5          стажер
Name: Position, dtype: object

In [74]:
frame[['Position']]  # What a beauty

       Position
0  Разнорабочий
1       инженер
2      менеджер
3  Разнорабочий
4       инженер
5        стажер

In [75]:
frame.head(3)  # First 3 lines

           Name      Birth       City      Position
0   Иванов А.А. 1980-03-22     Москва  Разнорабочий
1  Сорокин И.В. 1965-07-08  Волгоград       инженер
2    Белов М.М. 1980-02-13     Ростов      менеджер

In [76]:
frame[:3]

           Name      Birth       City      Position
0   Иванов А.А. 1980-03-22     Москва  Разнорабочий
1  Сорокин И.В. 1965-07-08  Волгоград       инженер
2    Белов М.М. 1980-02-13     Ростов      менеджер

In [77]:
frame[-3:]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  Разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [78]:
frame.loc[[1,3,5],['Name', 'City']]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [79]:
frame.iloc[[1,3,5],[0,2]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [82]:
#frame.ix[[1,3,5],['Name', 'City']]  --- pd.DataFrame.ix is no longer available in pandas due to causing confusion!!!

AttributeError: 'DataFrame' object has no attribute 'ix'

In [83]:
frame[frame.Birth >= pd.datetime(1985,1,1)]

<ipython-input-83-3db5156dbe3a>:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  frame[frame.Birth >= pd.datetime(1985,1,1)]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  Разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [84]:
frame[(frame.Birth >= pd.datetime(1985,1,1)) & (frame.City != 'Москва')]

<ipython-input-84-9b915131d3a6>:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  frame[(frame.Birth >= pd.datetime(1985,1,1)) & (frame.City != 'Москва')]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  Разнорабочий

In [88]:
frame.shape

(6, 4)

In [ ]:
'''
Lesson 3: Numpy, Matplotlib, Scipy
'''